{"keras_version": "2.2.4", "backend": "tensorflow", "class_name": "Sequential", "config": {"layers": [{"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "filters": 6, "kernel_size": [2, 2], "bias_regularizer": null, "name": "conv2d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "valid", "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "data_format": "channels_last", "dtype": "float32", "trainable": true, "use_bias": true, "activity_regularizer": null, "batch_input_shape": [null, 96, 96, 3]}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "filters": 6, "kernel_size": [2, 2], "bias_regularizer": null, "name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "valid", "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "data_format": "channels_last", "dtype": "float32", "trainable": true, "use_bias": true, "activity_regularizer": null, "batch_input_shape": [null, 96, 96, 3]}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "trainable": true}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_1", "trainable": true, "rate": 0.5, "noise_shape": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"units": 3, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "use_bias": true, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "softmax", "name": "activation_3", "trainable": true}}], "name": "sequential_1"}}